# LinkLoadContent Methods (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
LinkLoadContent Methods
LinkLoadContent Class See Also
---
The LinkLoadContent type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose | (Inherited from ExternalResourceLoadContent.) |
| Equals | Determines whether the specified Object is equal to the current Object. (Inherited from Object.) |
| GetHashCode | Serves as a hash function for a particular type.  (Inherited from Object.) |
| GetLinkDataPath | Returns the Link data path owned by this LinkLoadContent object. |
| GetLinkLoadResult | Retrieves the LinkLoadResult of the attempt to load or reload a Revit link. |
| GetType | Gets the Type of the current instance. (Inherited from Object.) |
| SetLinkDataPath | Sets the Link data path owned by this LinkLoadContent object. |
| ToString | Returns a string that represents the current object. (Inherited from Object.) |

# See Also
LinkLoadContent Class
Autodesk.Revit.DB Namespace